In [1]:
import pandas as pd 
import numpy as np
import os

#### 1.1. Creating a new DataFrame:

From a dictionary

In [2]:
data = {'Name': ['Thuc','Phong','Kien','Hoang'] , 'Age':[19,20,21,22],'Gender':['Male','Female','Male','Male']}
df = pd.DataFrame(data)
df

    Name  Age  Gender
0   Thuc   19    Male
1  Phong   20  Female
2   Kien   21    Male
3  Hoang   22    Male

#### 1.2. Reading data into a DataFrame:

In [3]:
# Go to the directory where the data file is located. 
# Please, replace the path with your own.

In [4]:
print("Thư mục làm việc hiện tại:", os.getcwd())

Thư mục làm việc hiện tại: c:\Users\PV\Documents\laptrinh\PythonProject\Khoahocdulieuproject(AI)

In [5]:
os.chdir(r'C:\Users\PV\Downloads\Chapter 3')

In [6]:
print("Thư mục làm việc hiện tại:", os.getcwd())

Thư mục làm việc hiện tại: C:\Users\PV\Downloads\Chapter 3

In [7]:
df = pd.read_csv('data_studentlist.csv',header ='infer')
df.shape

(17, 8)

In [8]:
df.ndim

2

In [9]:
df.columns

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [10]:
df

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       17 non-null     object
 1   gender     17 non-null     object
 2   age        17 non-null     int64
 3   grade      17 non-null     int64
 4   absence    17 non-null     object
 5   bloodtype  17 non-null     object
 6   height     17 non-null     float64
 7   weight     17 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.2+ KB

In [12]:
df.describe()

             age      grade      height     weight
count  17.000000  17.000000   17.000000  17.000000
mean   22.352941   2.294118  170.035294  61.064706
std     1.169464   1.104802    7.849756  11.851685
min    20.000000   1.000000  155.200000  45.200000
25%    22.000000   1.000000  165.300000  53.000000
50%    22.000000   2.000000  169.200000  61.300000
75%    23.000000   3.000000  176.100000  68.200000
max    24.000000   4.000000  182.100000  85.700000

In [13]:
df.columns = ['NAME', 'GENDER' , 'AGE', 'GRADE', 'ABSENCE', 'BLOODTYPE', 'HEIGHT', 'WEIGHT']
df.head(3)

             NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

#### 1.3. Indexing and slicing DataFrames:

In [14]:
# select a column 
df.NAME

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [15]:
df.loc[:,['NAME','GENDER']]

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [16]:
df.loc[2:4]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [17]:
df.iloc[2:4]

           NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2  Brian Martin      M   24      4       N         B   175.0    80.1
3  David Hassel      M   23      3       N        AB   182.1    85.7

In [18]:
df.drop(columns=['NAME','GENDER'])                  # This is just a view.
#df.drop(columns=['NAME','GENDER'],inplace=True)    # => To remove permanently.

    AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    23      3       Y         O   165.3    68.2
1    22      2       N        AB   170.1    53.0
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
6    22      1       N         O   155.2    45.3
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
9    22      2       N         B   176.1    61.3
10   24      4       Y         O   167.1    62.0
11   22      2       N        AB   180.0    75.8
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
14   22      2       N         B   158.2    45.2
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [19]:
df.set_index('NAME')

                 GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
NAME
Jared Diamond         M   23      3       Y         O   165.3    68.2
Sarah O'Donnel        F   22      2       N        AB   170.1    53.0
Brian Martin          M   24      4       N         B   175.0    80.1
David Hassel          M   23      3       N        AB   182.1    85.7
Clara Rodriquez       F   20      1       Y         A   168.0    49.5
Jennifer Lorentz      F   21      2       N         O   162.0    52.0
Susan Clark           F   22      1       N         O   155.2    45.3
Margareth Jones       F   23      1       N         A   176.9    55.0
John Bertsch          M   23      3       N         B   178.5    64.2
Jake Timmerman        M   22      2       N         B   176.1    61.3
Joshua Connor         M   24      4       Y         O   167.1    62.0
John Matsuda          M   22      2       N        AB   180.0    75.8
Eddy Johnson          M   21      1       N         A   162.2    55.3
Rebecah Anderson      F   23      3       N         O   176.1    53.1
Linda Carter          F   22      2       N         B   158.2    45.2
Richard Swayze        M   24      4       Y         B   168.6    70.2
Andrew King           M   21      1       N         A   169.2    62.2

In [20]:
df[df.GENDER == 'F'] # to select only persons with female gender

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [21]:
df[ (df.GENDER == 'M') & (df.HEIGHT > 175)] # to select only persons with male gender and taller than 175 centimeter

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
11    John Matsuda      M   22      2       N        AB   180.0    75.8

#### 1.4. File reading and writing:

Read and write in the CSV format

In [22]:
df2 = df.drop(columns=['GRADE','ABSENCE'])
df2.to_csv('data_mine.csv',index= False)

In [23]:
df3 = pd.read_csv('data_mine.csv',encoding='latin1',header='infer')

In [24]:
df3.head(3)

             NAME GENDER  AGE BLOODTYPE  HEIGHT  WEIGHT
0   Jared Diamond      M   23         O   165.3    68.2
1  Sarah O'Donnel      F   22        AB   170.1    53.0
2    Brian Martin      M   24         B   175.0    80.1

Read and write file exel

In [25]:
dfx = pd.read_excel('data_studentlist.xlsx', sheet_name='Sheet1')

In [26]:
dfx.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [27]:
dfx.to_excel('data_studentlist2.xlsx',sheet_name='NewSheet', index=False)

### Added

In [28]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
frame = pd.DataFrame(data)
frame
# create dictionary and convert to Frame data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [30]:
# if columns are designed in the desired order , data frame objects are greated accordingly
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [31]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])

In [32]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [33]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [34]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
frame2['debt']= np.arange(1.,7.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   1.0
two    2001    Ohio  1.7   2.0
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   4.0
five   2002  Nevada  2.9   5.0
six    2003  Nevada  3.2   6.0

When substituting a list or array into a column, the length of the value to be substituted must be equal to the size of the data frame. When a series is substituted, values are substituted according to the index of the data frame, and missing values are substituted for indeces that do not exist.

In [37]:
val = pd.Series([-1.2,-1.5, -1.7], index = ['two', 'three', 'four'])
frame2["debt"] = val 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4  -1.7
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [38]:
df = pd.DataFrame([[18,'female','DHYV'],[10,'male','DHCNHN']],
                  index = ['Hai Anh','Vo Thuc'],
                  columns=['age','sex','school'])
df

         age     sex  school
Hai Anh   18  female    DHYV
Vo Thuc   10    male  DHCNHN

In [39]:
df.rename(columns={'age':'years','sex':'gender','school':'university'}, inplace=True)

In [40]:
df

         years  gender university
Hai Anh     18  female       DHYV
Vo Thuc     10    male     DHCNHN

In [41]:
df.rename(index = {'Hai Anh':'sv1','Vo Thuc':'sv2'}, inplace=True)
df

     years  gender university
sv1     18  female       DHYV
sv2     10    male     DHCNHN

In [42]:
exam_data ={
    'math':[100,99,88] , 'eng':[77,88,99],'sience':[1,2,3],'music':[100,100,100]
}
df = pd.DataFrame(exam_data, index=['stu1','stu2','stu3'])
df

      math  eng  sience  music
stu1   100   77       1    100
stu2    99   88       2    100
stu3    88   99       3    100

In [43]:
df2 = df[:]
df2.drop('stu2',inplace=True)
df2

C:\Users\PV\AppData\Local\Temp\ipykernel_19376\762524632.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('stu2',inplace=True)

      math  eng  sience  music
stu1   100   77       1    100
stu3    88   99       3    100

In [44]:
# xoa columns axis = 1 or xoa rows axis = 0
df4 = df[:]
df4.drop('stu1',inplace=True,axis=0)
df4

C:\Users\PV\AppData\Local\Temp\ipykernel_19376\1241035316.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('stu1',inplace=True,axis=0)

      math  eng  sience  music
stu2    99   88       2    100
stu3    88   99       3    100

In [46]:
df5 = df[:]
df5.drop('eng',axis =1 , inplace=True)
df5

C:\Users\PV\AppData\Local\Temp\ipykernel_19376\766518642.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.drop('eng',axis =1 , inplace=True)

      math  sience  music
stu1   100       1    100
stu2    99       2    100
stu3    88       3    100

In [49]:
#Use the row index to select one row 
label1 = df.loc['stu1']
postison1 = df.iloc[0]
print(label1)
print("\n")
print(postison1)

math      100
eng        77
sience      1
music     100
Name: stu1, dtype: int64


math      100
eng        77
sience      1
music     100
Name: stu1, dtype: int64

In [54]:
# select two or more rows using the row index 
label2 = df.loc[['stu1','stu2']]
postison2 = df.iloc[[0,1]]
print(label2)
print("\n")
print(postison2)

      math  eng  sience  music
stu1   100   77       1    100
stu2    99   88       2    100


      math  eng  sience  music
stu1   100   77       1    100
stu2    99   88       2    100

In [55]:
# select row by specifying the range of the row index 
label3 = df.loc['stu1':'stu3']
postison3 = df.iloc[0:2]
print(label3)
print("\n")
print(postison3)

      math  eng  sience  music
stu1   100   77       1    100
stu2    99   88       2    100
stu3    88   99       3    100


      math  eng  sience  music
stu1   100   77       1    100
stu2    99   88       2    100

In [61]:
# selct only math point and save in math1 variable
math1 = df['math']
math1

stu1    100
stu2     99
stu3     88
Name: math, dtype: int64

In [57]:
# It should be noted that the results vary from series to data frames depending on the type of indexing.

In [62]:
#select the 'music' and 'sicene'score data , that gonna save in mus_sci variable
muc_sci = df[['music','sience']]
muc_sci

      music  sience
stu1    100       1
stu2    100       2
stu3    100       3

In [65]:
exam_data= {
    'name':['stu1','stu2','stu3'],
    'math':[70,80,90],
    'eng':[80,90,100],
    'music':[1,2,3],
    'science':[4,5,6],

}
df= pd.DataFrame(exam_data)
df.set_index('name', inplace=True)
df

      math  eng  music  science
name
stu1    70   80      1        4
stu2    80   90      2        5
stu3    90  100      3        6

In [68]:
# Select one specific element of the data frame df ('music' score of 'stu1')
a= df.loc['stu2','math']
print(a)
b= df.iloc[1,0]
print(b)

80
80

In [76]:
i = df.loc['stu1':'stu2', 'math':'science']
h = df.iloc[0:3,0:]
print(i)
print(h)
# lay bang dau :
g = df.loc[['stu1','stu2','stu3'],['math','music']]
h =df.iloc[[0,1,2],[0,2]]
print(g)
print(h)

      math  eng  music  science
name
stu1    70   80      1        4
stu2    80   90      2        5
      math  eng  music  science
name
stu1    70   80      1        4
stu2    80   90      2        5
stu3    90  100      3        6
      math  music
name
stu1    70      1
stu2    80      2
stu3    90      3
      math  music
name
stu1    70      1
stu2    80      2
stu3    90      3

In [77]:
# Add a 'history' score column to the data frame df. The value of the data is 80.
df['history'] = 80
print(df)

      math  eng  music  science  history
name
stu1    70   80      1        4       80
stu2    80   90      2        5       80
stu3    90  100      3        6       80

In [78]:
exam_data = {'name' : [ 'stu1', 'stu2', 'stu3'],
             'math' : [ 90, 80, 70],
             'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100],
             'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [79]:
# Add new row - enter the same element value
df.loc[3] = 0
print(df)

   name  math  eng  music  science
0  stu1    90   98     85      100
1  stu2    80   89     95       90
2  stu3    70   95    100       90
3     0     0    0      0        0

In [80]:

# Add new row - Enter an array of element values
df.loc[4] = ['stu4', 90, 80, 70, 60]
print(df)

   name  math  eng  music  science
0  stu1    90   98     85      100
1  stu2    80   89     95       90
2  stu3    70   95    100       90
3     0     0    0      0        0
4  stu4    90   80     70       60

In [81]:
exam_data = {'name' : [ 'stu1', 'stu2', 'stu3'],
             'math' : [ 90, 80, 70],
             'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100],
             'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [82]:
# The column "name" is designated as a new index, and changes are reflected in the df object. 
df.set_index('name', inplace=True)
print(df)

      math  eng  music  science
name
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [83]:
# A method of changing a specific element of the data frame df: 'science' score of 'stu1'
df.iloc[0][3] = 80
print(df)
print('\n')

df.loc['stu1']['science'] = 90
print(df)
print('\n')

df.loc['stu1', 'science'] = 100
print(df)
print('\n')

      math  eng  music  science
name
stu1    90   98     85       80
stu2    80   89     95       90
stu3    70   95    100       90


      math  eng  music  science
name
stu1    90   98     85       90
stu2    80   89     95       90
stu3    70   95    100       90


      math  eng  music  science
name
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

C:\Users\PV\AppData\Local\Temp\ipykernel_19376\137617611.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3] = 80
C:\Users\PV\AppData\Local\Temp\ipykernel_19376\137617611.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3] = 80
C:\Users\PV\AppData\Local\Temp\ipykernel_19376\137617611.py:6: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['stu1']['science'] = 90

In [84]:
# Defintion of Dictionary
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [85]:
# Redesignate the index to [r0, r1, r2, r3, r4]
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [86]:
# Fill in the NaN value generated by reindex with the number 0.
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [87]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [88]:
ndf =df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [89]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [90]:
# Sort row indeces in descending order.
ndf = df.sort_index(ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [91]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [92]:
ndf= df.sort_values(by = 'c2',ascending = False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [93]:
# Create pandas series with data from dictionary
student1 = pd.Series({'eng':100, 'math':80, 'science':90})
student2 = pd.Series({'science':80, 'eng':90, 'math':80})
print(student1)
print('\n')
print(student2)
print('\n')

eng        100
math        80
science     90
dtype: int64


science    80
eng        90
math       80
dtype: int64

In [94]:
# Perform arithmetic operation on the scores of each subject of the two students.
addition = student1 + student2               #addition
subtraction = student1 - student2            #subtraction
multiplication = student1 * student2         #multiplication
division = student1 / student2               #division
print(type(division))

<class 'pandas.core.series.Series'>

In [95]:
# Combine the results of the arithmetic operation into data frame (series -> data frame)
result = pd.DataFrame([addition, subtraction, multiplication, division], 
                      index=['addition', 'subtraction', 'multiplication', 'division'])
print(result)

                        eng    math   science
addition         190.000000   160.0   170.000
subtraction       10.000000     0.0    10.000
multiplication  9000.000000  6400.0  7200.000
division           1.111111     1.0     1.125

In [97]:
# Create pandas series with data from dictionary
student1 = pd.Series({'eng':np.nan, 'math':80, 'science':90})
student2 = pd.Series({'science':80, 'eng':90})
print(student1)
print('\n')
print(student2)
print('\n')

eng         NaN
math       80.0
science    90.0
dtype: float64


science    80
eng        90
dtype: int64

In [98]:
# Perform an arithmetic calculation with the scores of each subject of the two students (using the operation method)
sr_add = student1.add(student2, fill_value=0)   #addition
sr_sub = student1.sub(student2, fill_value=0)   #subtraction
sr_mul = student1.mul(student2, fill_value=0)   #multiplication
sr_div = student1.div(student2, fill_value=0)   #division

In [99]:
# Combine the results of the arithmetic operation into data frame (series -> data frame)
result = pd.DataFrame([sr_add, sr_div,sr_mul,sr_div] , index= ['addition', 'subtraction', 'multiplication','division'] )
result

                 eng  math   science
addition        90.0  80.0   170.000
subtraction      0.0   inf     1.125
multiplication   0.0   0.0  7200.000
division         0.0   inf     1.125